Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetDrawingObjectSelector Method
 Gets a drawing object selector. With a drawing object selector drawing objects can be selected and highlighted in the drawing editor. A drawing object selector also provides a list of currently selected drawing objects.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectSelector GetDrawingObjectSelector()
Public Function GetDrawingObjectSelector As DrawingObjectSelector
Return Value
Type: DrawingObjectSelector
The drawing object selector for the current drawing. Null if no drawing is active.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace